SPHERES = [
    "Развитие",
    "Отношения",
    "Работа и реализация",
    "Творчество",
    "Обучение",
    "Окружение",
    "Отдых",
    "Деньги",
    "Здоровье"
]


def get_questions_for_sphere(sphere: str):
    return [
        {
            "type": "text",
            "key": f"{sphere}_meaning",
            "question": f"{sphere}\n\nЧто для тебя значит эта сфера?"
        },
        {
            "type": "choice",
            "key": f"{sphere}_satisfaction",
            "question": "Насколько ты сейчас доволен этой сферой?",
            "options": [
                "Очень плохо",
                "Плохо",
                "Средне",
                "Хорошо",
                "Очень хорошо"
            ],
            "scores": [1, 2, 3, 4, 5]
        },
        {
            "type": "choice",
            "key": f"{sphere}_importance",
            "question": "Насколько это важно для тебя?",
            "options": [
                "Не важно",
                "Скорее не важно",
                "Средне",
                "Важно",
                "Очень важно"
            ],
            "scores": [1, 2, 3, 4, 5]
        },
        {
            "type": "choice",
            "key": f"{sphere}_action",
            "question": "Что ты сейчас делаешь для развития этой сферы?",
            "options": [
                "Я этим занимаюсь",
                "Иногда уделяю внимание",
                "Пока откладываю"
            ],
            "scores": [3, 2, 1]
        }
    ]
