questions = [
# ЖЕРТВА
{"id": 1, "text": "У меня преобладает пессимистичное настроение.", "role": "victim"},
{"id": 2, "text": "Мне НЕ нравится собственная жизнь.", "role": "victim"},
{"id": 3, "text": "Любые события я оцениваю с негативной стороны.", "role": "victim"},
{"id": 4, "text": "Я НЕ стесняюсь своих слабостей.", "role": "victim"},
{"id": 5, "text": "В моей жизни всегда случается что-то, что мешает мне достичь своих целей.", "role": "victim"},
{"id": 6, "text": "Мне кажется, что я не могу влиять на то, что происходит в моей жизни.", "role": "victim"},
{"id": 7, "text": "Я часто жалею себя.", "role": "victim"},
{"id": 8, "text": "Я считаю, что большее значение в достижении успеха имеют внешние обстоятельства, чем мои действия.", "role": "victim"},

# СПАСАТЕЛЬ
{"id": 9, "text": "Я жертвую своими интересами в пользу других людей.", "role": "rescuer"},
{"id": 10, "text": "Для меня важно чувствовать, что я могу быть полезным(ой) другим людям.", "role": "rescuer"},
{"id": 11, "text": "Мне сложно отказывать людям.", "role": "rescuer"},
{"id": 12, "text": "Я часто ставлю интересы других выше своих собственных.", "role": "rescuer"},
{"id": 13, "text": "Мне часто приходится решать чужие проблемы или облегчать чьи-то задачи.", "role": "rescuer"},
{"id": 14, "text": "Мне часто говорят, что я очень отзывчивый и добрый человек.", "role": "rescuer"},
{"id": 15, "text": "Я часто сдерживаю свои чувства и слова, чтобы НЕ обидеть другого человека.", "role": "rescuer"},
{"id": 16, "text": "Мне приятно видеть, как моя помощь делает жизнь других лучше.", "role": "rescuer"},

# ПРЕСЛЕДОВАТЕЛЬ
{"id": 17, "text": "Я считаю, что успех в жизни зависит от настойчивости и готовности работать усердно.", "role": "persecutor"},
{"id": 18, "text": "Для меня важно быть на вершине и быть лучшим(ей) в том, что я делаю.", "role": "persecutor"},
{"id": 19, "text": "Окружающий мир жесток, слабым тут НЕ место.", "role": "persecutor"},
{"id": 20, "text": "Я оказываю помощь людям, только в тех случаях, когда мне это выгодно.", "role": "persecutor"},
{"id": 21, "text": "Я всегда готов(а) к нападению и осуждению других людей.", "role": "persecutor"},
{"id": 22, "text": "Мое доверие и уважение сложно заслужить.", "role": "persecutor"},
{"id": 23, "text": "Я часто манипулирую людьми.", "role": "persecutor"},
{"id": 24, "text": "Я легко нахожу болевые точки и слабые места людей.", "role": "persecutor"},
]
